In [1]:
import pandas as pd
import numpy as np

In [2]:
data={
    "A":[1,3,np.nan,4,6],
    "B":[np.nan,2,5,8,9],
    "C":[4,9,7,np.nan,np.nan],
    "D":[1,np.nan,np.nan,np.nan,6]
}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

     A    B    C    D
0  1.0  NaN  4.0  1.0
1  3.0  2.0  9.0  NaN
2  NaN  5.0  7.0  NaN
3  4.0  8.0  NaN  NaN
4  6.0  9.0  NaN  6.0

In [9]:
df.isna().sum()

A    1
B    1
C    2
D    3
dtype: int64

In [6]:
df.isna().any()

A    True
B    True
C    True
D    True
dtype: bool

In [7]:
df

     A    B    C    D
0  1.0  NaN  4.0  1.0
1  3.0  2.0  9.0  NaN
2  NaN  5.0  7.0  NaN
3  4.0  8.0  NaN  NaN
4  6.0  9.0  NaN  6.0

In [8]:
df.dropna()

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [12]:
df.dropna(thresh=3)

     A    B    C    D
0  1.0  NaN  4.0  1.0
1  3.0  2.0  9.0  NaN
4  6.0  9.0  NaN  6.0

In [13]:
df

     A    B    C    D
0  1.0  NaN  4.0  1.0
1  3.0  2.0  9.0  NaN
2  NaN  5.0  7.0  NaN
3  4.0  8.0  NaN  NaN
4  6.0  9.0  NaN  6.0

In [18]:
df.fillna(0)

     A    B    C    D
0  1.0  0.0  4.0  1.0
1  3.0  2.0  9.0  0.0
2  0.0  5.0  7.0  0.0
3  4.0  8.0  0.0  0.0
4  6.0  9.0  0.0  6.0

In [20]:
value={"A":100,"B":400,"C":700,"D":600}
df.fillna(value=value)

       A      B      C      D
0    1.0  400.0    4.0    1.0
1    3.0    2.0    9.0  600.0
2  100.0    5.0    7.0  600.0
3    4.0    8.0  700.0  600.0
4    6.0    9.0  700.0    6.0